# сума = депозирана сума  + срок на депозита * ((депозирана сума * годишен лихвен процент ) / 12)
#    1. Депозирана сума – реално число в интервала [100.00 … 10000.00]
#     2. Срок на депозита (в месеци) – цяло число в интервала [1…12]
#     3. Годишен лихвен процент – реално число в интервала [0.00 …100.00]

deposit_sum = float(input())
deposit_due = int(input())
annual_percent = float(input())

end_sum = deposit_sum + deposit_due * ((deposit_sum * (annual_percent/100)) / 12)

print(end_sum)
